import React, { useState } from "react";

import { Modal } from "../../components";

import "./PrivacyModal.css";

export const usePrivacyModal = () => {
  const [privacyOpen, setPrivacyOpen] = useState(false);

  const onClose = () => {
    setPrivacyOpen(false);
  };

  const onOpen = () => {
    setPrivacyOpen(true);
  };

  const component = (
    <Modal isOpen={privacyOpen} onClose={onClose}>
      <div className="privacyWrapper">
        <p>Політика конфіденційності</p>
        <p>1. Загальні положення</p>
        <pre>
          З метою захисту персональних даних наших користувачів, інформуємо вас
          про те, які саме дані ми збираємо і яким чином їх використовуємо на
          сайті (адреса сайту/домен) (далі – Сайт). Предмет Політики – порядок
          обробки персональних даних Користувачів сайту. Політика містить
          інформацію щодо порядку збору, зберігання, обробки та використання
          персональних даних користувачів Сайту. Будь ласка, уважно ознайомтеся
          з Політикою, перед використанням Сайту. Користуючись Сайтом, ви
          висловлюєте повну і беззастережну згоду з Політикою і зазначеними в
          ній умовами надання, збору, обробки ваших персональних даних.
          Відповідно до Закону України від 01 червня 2010 року No 2297-VI «Про
          захист персональних даних» (далі — «Закон») під персональними даними
          розуміють відомості чи сукупність відомостей про фізичну особу, яка
          ідентифікована або може бути конкретно ідентифікована.
        </pre>
        <p>2. Перелік персональних даних, які ми збираємо</p>
        <pre>
          Для надання Замовникам можливості користування Сайтом та замовлення
          Послуг, ми можемо збирати наступні персональні дані користувачів через
          Google Forms: <br />● Імʼя
          <br />● Контактні дані (адреса електронної пошти, номер телефону, імʼя
          користувача та (або) інші контактні дані).
          <br />
          ●Нік в телеграмі
          <br />● Дані, які збираються Сайтом автоматично: файли cookie,
          технічна інформація про пристрій, з якого здійснюється користування
          Сайтом (зокрема, тип браузера, тип і модель пристрою, версія
          операційної системи), інформація про взаємодію користувача з Сайтом
          (зокрема, час доступу, адреса запитуваної сторінки), інформація про
          відвідування і використання Сайту; інформація, що міститься в
          будь-яких повідомленнях, які ви відправляєте нам по електронній пошті
          або через наш Сайт; будь-яка інша особиста інформація, яку ви вносите
          під час реєстрації на Сайті.
        </pre>
        <p>3. Цілі опрацювання персональних даних</p>
        <pre>
          Персональні дані, надані вами через сайт, можуть бути використані для
          цілей: адміністрування сайту; відправки повідомлень; запису на
          отримання Послуг Виконавця та надання доступу до матеріалів;
          забезпечення безпеки сайту і запобігання шахрайству; інших видів
          використання, зокрема в маркетингових цілях.
        </pre>
        <p>
          4. Доступ до ваших персональних даних та його надання третім особам
        </p>
        <pre>
          Надання доступу до персональної інформації третім особам, можливе лише
          за наступних обставин:
          <br />● надання Замовником однозначної згоди на таку передачу;
          <br />● необхідності укладення чи виконання правочину між Виконавцем
          та третьою особою на користь Замовника, у разі надання Замовником
          однозначної згоди на таку передачу;
          <br />● у випадках запобігання злочину або завдання шкоди нам або
          третім особам;
          <br />● у випадках передбачених чинним законодавством України.
          <br />
          За винятком випадків, передбачених у цій Політиці, ми зобов’язуємося
          не надавати вашу особисту інформацію третім особам.
        </pre>
        <p>5. Строк зберігання персональних даних</p>
        <pre>
          Ми зберігаємо персональні дані лише протягом строку, який є необхідним
          для реалізації цілей, визначених у пункті 1 Політики. Обробка
          персональних даних відбувається у строк, не більший, ніж це необхідно
          відповідно до законного призначення та цілей, визначених цією
          Політикою. Ваша згода на опрацювання персональних даних діє протягом
          невизначеного строку.
        </pre>
        <p>
          6. Права користувачів Сайту (Замовників) щодо належних їм персональних
          даних
        </p>
        <pre>
          Всі користувачі Сайту (Замовники) мають наступні права, пов’язані з
          збиранням, зберіганням, обробкою та використанням їх персональних
          даних:
          <br />● Знати про джерела збирання персональних даних, їх
          місцезнаходження, мету обробки персональних даних, місцезнаходження
          володільця чи розпорядника персональних даних.
          <br />● Отримувати інформацію про те, чи обробляються їх персональні
          та які саме.
          <br />● Вимагати припинити обробку персональних даних, змінити або
          знищити персональні дані, якщо ці дані є недостовірними.
          <br />● Відкликати згоду на обробку персональних даних тощо.
          <br />
          Для реалізації цих прав необхідно звернутися із письмовою заявою, на
          наступну електронну адресу: katrin.polovinko2918@gmail.com
        </pre>
        <p>7. Безпека даних</p>
        <pre>
          Для захисту ваших персональних даних вжито всіх необхідних заходів від
          несанкціонованого доступу, зміни, розкриття чи знищення із
          застосуванням відповідних технічних і організаційних інструментів.
        </pre>
        <p>8. Зміни до умов Політики</p>
        <pre>
          Політика конфіденційності може змінюватися. Зміни, що вносяться до
          Політики, публікуються на Сайті. Всі зміни набувають чинності з
          моменту їх публікації. Продовжуючи, використовувати Сайт, ви
          підтверджує згоду з новими умовами Політики у редакції, чинній на
          момент використання сайту.
        </pre>
        <p>9. Контактна інформація</p>
        <pre>
          Якщо у вас виникнуть будь-які запитання щодо нашої Політики, ви можете
          звернутись до нас за наступною електронною адресою:
          katrin.polovinko2918@gmail.com
        </pre>
        <p>10. Згода користувачів</p>
        <pre>
          Користуючись нашим сайтом, ви підтверджуєте, що ознайомлені з умовами
          цієї Політики і правами, наданими суб’єктам персональних даних згідно
          зі ст. 8 Закону України «Про захист персональних даних» та
          погоджуєтеся з викладеними умовами.
        </pre>
      </div>
    </Modal>
  );

  return {
    isOpen: privacyOpen,
    onClose,
    onOpen,
    component,
  };
};
