import React, { useState } from "react";

import { Modal } from "../../components";

import "./DeliveryModal.css";

export const useDeliveryModal = () => {
  const [deliveryOpen, setDeliveryOpen] = useState(false);

  const onClose = () => {
    setDeliveryOpen(false);
  };

  const onOpen = () => {
    setDeliveryOpen(true);
  };

  const component = (
    <Modal isOpen={deliveryOpen} onClose={onClose}>
      <div className="deliveryWrapper">
        <p>Доставка по Україні</p>
        <pre>
          ● Клієнти з України можуть отримати замовлення протягом 1–4 робочих
          днів (залежно від вашого міста та обраного способу доставки).
          <br />● Доставка здійснюється у населені пункти, де є відділення Нової
          Пошти або Укрпошти.
          <br />● Точні терміни та вартість доставки ви зможете дізнатися після
          оформлення замовлення.
          <br />
          <br />
          Будь ласка, перевіряйте замовлення при отриманні:
          <br />● комплектацію,
          <br />● цілісність упаковки,
          <br />● відсутність механічних пошкоджень.
          <br />
          <br />
          Це можна зробити безпосередньо у відділенні перевізника в присутності
          працівників служби доставки. Ми не несемо відповідальності за товар,
          якщо його не було перевірено під час отримання.
          <br />
          Якщо товар пошкоджений, ви маєте право відмовитися від його отримання
          та не оплачувати.
        </pre>
        <p>Міжнародна доставка від Nova Post</p>
        <pre>
          Nova Post надає міжнародну експрес-доставку документів, посилок і
          вантажів в Україну та за кордон у найкоротші терміни.
          <br />
          Детальна інформація про послуги та відстеження відправлень – на сайті{" "}
          <a href="https://novapost.com" target="_blank" rel="noreferrer">
            novapost.com.
          </a>
          <br />
          <br />
          Вартість доставки
          <br />● Залежить від країни призначення, ваги, габаритів відправлення
          та обраних додаткових послуг.
          <br />● Точну вартість можна дізнатися під час оформлення замовлення.
          <br />
          <br />
          Важливо знати
          <br />● Перевірте умови ввезення товарів у вашу країну перед
          оформленням замовлення (
          <a href="https://novapost.com" target="_blank" rel="noreferrer">
            novapost.com
          </a>
          ).
          <br />● Ми не несемо відповідальності за затримки на митниці або
          конфіскацію замовлень.
          <br />
          <br />
          Додаткові витрати
          <br />● Митні збори та ПДВ не включені у вартість доставки, оскільки
          вони залежать від країни призначення.
          <br />● Якщо вартість замовлення перевищує 150 євро, додаються
          брокерські послуги, які оплачуються разом із доставкою під час
          оформлення замовлення.
        </pre>
      </div>
    </Modal>
  );

  return {
    isOpen: deliveryOpen,
    onClose,
    onOpen,
    component,
  };
};
